# " " - примеры
#
# размеры файлов в удобочитаемом формате
# ls -lh
# вывод содержимого папки
# ls -R
# узнаете свой текущий рабочий каталог
# pwd
# вывод содержимого файла целиком
# cat "/etc /group"
# вывод содержимого файла по страницам
# less "/etc/services"
#
# создать пустой файл
# touch "myfile"
# редакторы текста
# gedit
# vim
# nano
#
# информация о файле
# stat "myfile"
# создание папки
# mkdir "myplace"
# удалить папку
# rmdir "myplace"
# рекурсивное удаление всех "внутренностей"
# rm -r "myplace"
#
# идентичнуая копия объекта, созданная в каталоге
# cр "file1" "newdir"
# переместить объект в другой каталог
# mv "file2" "newdir"
#
# переместить файлы начинающиеся с file
# mv file* "/some/other/directory"
# переместить файлы начинающиеся с file(от file1 до file9)
# mv file? "/some/other/directory"
